---
type: Checker
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 13
tags: [revit-api, class]
---

# Checker

`Autodesk.Revit.DB.Visual.Checker` · Revit 2024 · 13 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CheckerColor1 | 2018.1 | `public static string CheckerColor1 { get ; }` |
| Property | CheckerColor2 | 2018.1 | `public static string CheckerColor2 { get ; }` |
| Property | CheckerSoften | 2018.1 | `public static string CheckerSoften { get ; }` |
| Property | TextureLinkTextureTransforms | 2018.1 | `public static string TextureLinkTextureTransforms { get ; }` |
| Property | TextureOffsetLock | 2018.1 | `public static string TextureOffsetLock { get ; }` |
| Property | TextureRealWorldOffsetX | 2018.1 | `public static string TextureRealWorldOffsetX { get ; }` |
| Property | TextureRealWorldOffsetY | 2018.1 | `public static string TextureRealWorldOffsetY { get ; }` |
| Property | TextureRealWorldScaleX | 2018.1 | `public static string TextureRealWorldScaleX { get ; }` |
| Property | TextureRealWorldScaleY | 2018.1 | `public static string TextureRealWorldScaleY { get ; }` |
| Property | TextureScaleLock | 2018.1 | `public static string TextureScaleLock { get ; }` |
| Property | TextureURepeat | 2018.1 | `public static string TextureURepeat { get ; }` |
| Property | TextureVRepeat | 2018.1 | `public static string TextureVRepeat { get ; }` |
| Property | TextureWAngle | 2018.1 | `public static string TextureWAngle { get ; }` |